In [3]:
list = [1,2,3,4,5]
print(list[3])

4

In [11]:
for items in list:
    print(items , end ="," )

1,2,3,4,5,

In [19]:
list[2]=10
print(list)

[1, 2, 10, 4, 5]

In [37]:
ind =0
for items in list:
    if items == 2:
        list[ind]=45
        ind+=1
print(list)

[45, 2, 10, 4, 5]

In [ ]:
data = {key:value}

In [1]:
my_diet ={
    "name":"Quinn",
     "age":23,
}

In [3]:
print(my_diet)

{'name': 'Quinn', 'age': 23}

In [21]:
my_dictionary={
    "name":["person 1","person 2","person 3","person 4","person 5"],
    "age":[23,22,21,20,24],
    "salary":[40000,50000,60000,70000,80000]
}
print(my_dictionary)

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'], 'age': [23, 22, 21, 20, 24], 'salary': [40000, 50000, 60000, 70000, 80000]}

In [9]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [23, 22, 21, 20, 24],
 'salary': [40000, 50000, 60000, 70000, 80000]}

In [11]:
print(my_dictionary)

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'], 'age': [23, 22, 21, 20, 24], 'salary': [40000, 50000, 60000, 70000, 80000]}

In [19]:
my_dictionary["Location"] =["Mombasa","Kisumu","Nakuru","Homabay"]

In [25]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [23, 22, 21, 20, 24],
 'salary': [40000, 50000, 60000, 70000, 80000]}

In [23]:
del my_dictionary["Location"]

In [27]:
for key,value in my_dictionary.items():
    print(key,value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [23, 22, 21, 20, 24]
salary [40000, 50000, 60000, 70000, 80000]

In [29]:
my_dictionary.get("age")

[23, 22, 21, 20, 24]

In [99]:
table ={
    "names":["Alice","John","Brice","Anita"],
    "age":[20,21,23,24],
    "Month of birth":["September","July","August","December"],
    

}

In [91]:
table

{'names': ['Alice', 'John', 'Brice', 'Anita'],
 'age': [20, 21, 23, 24],
 'Month of birth': ['September', 'July', 'August', 'December']}

In [85]:
table

{'names': ['Alice', 'John', 'Brice', 'Anita'],
 'age': [20, 21, 23, 24],
 'Month of birth': ['September', 'July', 'August', 'December']}

In [63]:
tuple =("hello","world","call")

In [79]:
tuple

('hello', 'world', 'call')

In [15]:
import pandas as pd

In [23]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [23, 22, 21, 20, 24],
 'salary': [40000, 50000, 60000, 70000, 80000]}

In [25]:
df = pd.DataFrame(my_dictionary)

In [27]:
df

       name  age  salary
0  person 1   23   40000
1  person 2   22   50000
2  person 3   21   60000
3  person 4   20   70000
4  person 5   24   80000

In [31]:
df.dtypes

name      object
age        int64
salary     int64
dtype: object

In [101]:
dataframe =pd.DataFrame(table)

In [103]:
dataframe

   names  age Month of birth
0  Alice   20      September
1   John   21           July
2  Brice   23         August
3  Anita   24       December

In [119]:
df[["name" ,"age" , "salary"]]

       name  age  salary
0  person 1   23   40000
1  person 2   22   50000
2  person 3   21   60000
3  person 4   20   70000
4  person 5   24   80000

In [125]:
df["age"]+1

0    24
1    23
2    22
3    21
4    25
Name: age, dtype: int64

In [127]:
df["name"]+"1"

0    person 11
1    person 21
2    person 31
3    person 41
4    person 51
Name: name, dtype: object

In [135]:
df.dtypes

name      object
age        int64
salary     int64
dtype: object

In [189]:
Student_Scores ={
    "Students":["Student 1","Student 2","Student 3"],
    "Maths":[80,90,60],
    "Science":[60,50,70],
    "English":[70,70,60],
    
}

In [191]:
Student_Scores

{'Students': ['Student 1', 'Student 2', 'Student 3'],
 'Maths': [80, 90, 60],
 'Science': [60, 50, 70],
 'English': [70, 70, 60]}

In [171]:
df=pd.DataFrame(Student_Scores)

In [193]:
df

    Students  Maths  Science  English
0  Student 1     80       60       70
1  Student 2     90       50       70
2  Student 3     60       70       60

In [196]:
df["Students"]

0    Student 1
1    Student 2
2    Student 3
Name: Students, dtype: object

In [214]:
df[["Maths","Science"]] = df[["Maths","Science"]]

In [216]:
df

    Students  Maths  Science  English
0  Student 1     85       65       70
1  Student 2     95       55       70
2  Student 3     65       75       60

In [218]:
df

    Students  Maths  Science  English
0  Student 1     85       65       70
1  Student 2     95       55       70
2  Student 3     65       75       60

In [220]:
df["Maths"],df["Science"] =df["Maths"]+1,df["Science"]+2

In [222]:
df

    Students  Maths  Science  English
0  Student 1     86       67       70
1  Student 2     96       57       70
2  Student 3     66       77       60

In [224]:
type(df)

pandas.core.frame.DataFrame

In [230]:
df[0:2]

    Students  Maths  Science  English
0  Student 1     86       67       70
1  Student 2     96       57       70

In [236]:
df

    Students  Maths  Science  English
0  Student 1     86       67       70
1  Student 2     96       57       70
2  Student 3     66       77       60

In [43]:
temperature =[56,34,67]
# for fahrenheit_temperatures in temperature:
    # fahrenheit_temperatures =["45F","78F","89F"]

In [45]:
fahrenheit_temperatures= [temp*7 for temp in temperature ]

In [47]:
fahrenheit_temperatures

[392, 238, 469]

In [69]:
temperature =[56,34,67]
fahrenheit_temperatures=[]

for temp in temperature :
     fahrenheit =(temp * 9/5) + 32
fahrenheit_temperatures.append( fahrenheit )
    
print(fahrenheit_temperatures)

[152.6]

In [67]:
fahrenheit_temperatures

[152.6]

In [63]:
# List of temperatures in Celsius
temperatures = [0, 10, 20, 30, 40, 50]

# Initialize an empty list to store Fahrenheit temperatures
fahrenheit_temperatures = []

# Loop through each temperature in the Celsius list and convert it to Fahrenheit
for temp in temperatures:
    fahrenheit = (temp * 9/5) + 32
    fahrenheit_temperatures.append(fahrenheit)

# Output the Fahrenheit temperatures
print(fahrenheit_temperatures)

[32.0, 50.0, 68.0, 86.0, 104.0, 122.0]

In [81]:
numbers =[10,20,40,50]
Squares =[]
for num in numbers :
    Square=num**2
    Squares.append(Square)
Squares

[100, 400, 1600, 2500]

In [83]:
numbers =[10,20,40,50]
Squares =[num**2 for num in numbers]  # using list comprehension
Squares

[100, 400, 1600, 2500]

In [89]:
temperature=[0,10,20]
fahrenheit_temperatures=[]
for temp in temperature:
    fahrenheit=(temp*9/5)+32
    fahrenheit_temperatures.append(fahrenheit)
fahrenheit_temperatures

[32.0, 50.0, 68.0]

In [93]:
temperature = [0,10,20]
fahrenheit_temperatures =[(temp*9/5)+32 for temp in temperature]
fahrenheit_temperatures

[32.0, 50.0, 68.0]

In [9]:
Student_Scores ={
    "Students":["Student 1","Student 2","Student 3"],
    "Maths":[80,90,60],
    "Science":[60,50,70],
    "English":[70,70,60],
    
}
Average =[("Maths"+"Science"+"English")/3 for score in "Maths" and "English" and "Science"]

TypeError: unsupported operand type(s) for /: 'str' and 'int'

In [1]:
temperature =[0,10,20]
fahrenheit_temperatures=[a+2 for a in temperature]cf

In [3]:
fahrenheit_temperatures

[2, 12, 22]

In [9]:
temperature =[0,10,20]
fahrenheit_temperatures=[]
for temp in temperature:
    fahrenheit = temp+2
    fahrenheit_temperatures.append(fahrenheit )

In [11]:
fahrenheit_temperatures

[2, 12, 22]